<?php

$professions = [
	"Авиатор", "Автомеханик", "Агроном", "Адвокат", "Актёр", "Аналитик", "Аниматор", "Архитектор",
	"Астроном", "Аудитор", "Банкир", "Бармен", "Бариста", "Библиотекарь", "Биолог",
	"Блогер", "Бухгалтер", "Ветеринар", "Визажист", "Водитель", "Водолаз", "Воспитатель", "Врач",
	"Генетик", "Геолог", "Гончар", "Грузчик", "Гувернантка", "Дворник",
	"Дизайнер", "Дипломат", "Директор", "Дирижёр", "Диспетчер", "Драматург",
	"Дрессировщик", "Егерь", "Жестянщик", "Журналист", "Иллюзионист", "Инженер", "Инспектор",
	"Кассир", "Капитан", "Каменщик", "Кинолог", "Клерк", "Клоун", "Кондитер", "Кондуктор",
	"Конструктор", "Консультант", "Космонавт", "Кочегар", "Крановщик", "Кузнец",
	"Курьер", "Лаборант", "Лесничий", "Лётчик", "Лифтёр", "Логопед", "Маляр", "Маркетолог",
	"Массажист", "Машинист", "Менеджер", "Металлург", "Метеоролог", "Механик", "Микробиолог", "Модель",
	"Модельер", "Монтажник", "Музыкант", "Нотариус", "Официант", "Охранник", "Охотник",
	"Офтальмолог", "Пекарь", "Парикмахер", "Парфюмер", "Переводчик", "Пилот", "Писатель",
	"Плотник", "Повар", "Пожарный", "Полицейский", "Политолог", "Программист", "Продавец", "Продюсер",
	"Прокурор", "Психолог", "Пчеловод", "Радист", "Редактор", "Режиссёр", "Репортёр", "Реставратор",
	"Риелтор", "Рыбак", "Сантехник", "Сварщик", "Секретарь", "Селекционер", "Сиделка", "Синоптик",
	"Слесарь", "Социолог", "Спасатель", "Стилист", "Столяр", "Стоматолог", "Строитель", "Стюардесса",
	"Судья", "Сценарист", "Таксист", "Тамада", "Татуировщик", "Телохранитель", "Токарь",
	"Топограф", "Тренер", "Ткач", "Учёный", "Учитель", "Фермер", "Фармацевт", "Физик",
	"Филолог", "Финансист", "Фотограф", "Фрезеровщик", "Химик", "Хирург", "Художник", "Шахтёр",
	"Швейцар", "Швея", "Шкипер", "Шоумен", "Штурман", "Эколог", "Экономист", "Экскурсовод",
	"Электрик", "Ювелир", "Юрист", "Языковед",
];

$animals = [
	"Аист", "Акула", "Аллигатор", "Альпака", "Антилопа", "Бабуин", "Баран", "Барсук",
	"Бегемот", "Белка", "Бобр", "Буйвол", "Бурундук", "Варан",
	"Верблюд", "Волк", "Вомбат", "Ворон", "Выдра", "Выхухоль", "Газель", "Гадюка",
	"Гепард", "Гиена", "Гиппопотам", "Глухарь", "Горилла", "Горностай", "Грач", "Гриф",
	"Гусь", "Дикобраз", "Дельфин", "Дрозд", "Дятел", "Ехидна", "Енот",
	"Жаба", "Жираф", "Журавль", "Заяц", "Зебра", "Зубр", "Игуана", "Индюк",
	"Кабан", "Какаду", "Кальмар", "Канарейка", "Карась", "Касатка", "Кашалот", "Кенгуру",
	"Кобра", "Коала", "Козел", "Койот", "Колибри", "Кондор", "Корова", "Коршун",
	"Краб", "Крокодил", "Крот", "Кролик", "Крыса", "Кукушка", "Куница", "Курица",
	"Лама", "Ласка", "Лебедь", "Лемур", "Леопард", "Лиса", "Лось", "Лошадь",
	"Лягушка", "Макака", "Мамонт", "Мангуст", "Медведь", "Медуза", "Морж", "Муравьед",
	"Нарвал", "Носорог", "Нутрия", "Обезьяна", "Овца", "Окунь", "Олень", "Ондатра",
	"Орел", "Осел", "Осетр", "Осьминог", "Павлин", "Панда", "Пантера", "Попугай",
	"Пингвин", "Питон", "Пума", "Рысь", "Росомаха", "Рябчик", "Сапсан", "Свинья",
	"Сельдь", "Синица", "Скорпион", "Слон", "Снегирь", "Сова",
	"Сокол", "Сорока", "Суслик", "Тапир", "Тигр", "Тритон", "Тунец",
	"Тушканчик", "Тюлень", "Удав", "Улитка", "Утка", "Утконос", "Фазан", "Филин",
	"Фламинго", "Хомяк", "Хорек", "Цапля", "Чайка", "Черепаха", "Шимпанзе",
	"Шиншилла", "Щука", "Шакал", "Шершень", "Ягуар", "Ястреб", "Ящерица", "Ягуана",
];

$food = [
	"Абрикос", "Авокадо", "Аджика", "Ананас", "Апельсин", "Арбуз", "Баклажан",
	"Банан", "Баранка", "Бекон", "Блин", "Болоньезе",
	"Борщ", "Брауни", "Брокколи", "Брынза", "Бублик", "Булочка", "Бутерброд", "Васаби",
	"Вафля", "Ветчина", "Винегрет", "Виноград", "Выпечка", "Онигири", "Гамбургер", "Гарнир",
	"Грейпфрут", "Грильяж", "Груша", "Гуакамоле", "Гуляш", "Десерт", "Дыня", "Ежевика",
	"Запеканка", "Зефир", "Земляника", "Имбирь", "Инжир", "Йогурт",
	"Кабачок", "Какао", "Кальмар", "Карамель", "Карбонара", "Картофель", "Каша", "Квас",
	"Кефир", "Кекс", "Кетчуп", "Киви", "Кисель", "Клубника", "Колбаса",
	"Компот", "Конфета", "Кофе", "Котлета", "Креветка", "Круассан", "Кукуруза", "Кумкват",
	"Лазанья", "Лайм", "Лимон", "Лимонад", "Лосось", "Макароны", "Майонез",
	"Манго", "Мандарин", "Маринад", "Мармелад", "Марципан", "Маффин", "Медовик", "Морковь",
	"Мороженое", "Нектарин", "Нуга", "Огурец", "Оладьи", "Омлет",
	"Папайя", "Пармезан", "Пастила", "Пельмени", "Персик", "Песто", "Пирог",
	"Пирожное", "Питание", "Пицца", "Плов", "Пломбир", "Повидло", "Подливка",
	"Помело", "Пряник", "Рагу", "Редис", "Репа", "Ряженка", "Салат", "Сальса",
	"Сацебели", "Свекла", "Сельдерей", "Сельдь", "Сливки", "Слива", "Сметана", "Сосиска",
	"Спаржа", "Суфле", "Сухарь", "Сэндвич", "Тартар", "Творог", "Терияки", "Тирамису",
	"Томат", "Торт", "Тыква", "Уксус", "Фарш", "Финики", "Фисташки",
	"Фондю", "Хачапури", "Халва", "Хлеб", "Хрен", "Хурма", "Чизкейк", "Чеснок",
	"Шоколад", "Шпинат", "Штрудель", "Шашлык", "Эклер", "Яблоко", "Ягода", "Яичница"
];

$tech = [
	"Автобус", "Автомобиль", "Агрегат", "Акустика", "Амперметр", "Аппарат", "Аэроплан", "Блендер",
	"Бойлер", "Бульдозер", "Вагон", "Вентилятор", "Вертолет", "Видеокамера", "Видеоплеер", "Внедорожник",
	"Водонагреватель", "Вытяжка", "Газонокосилка", "Генератор", "Гироскутер",
	"Диктофон", "Дирижабль", "Дрель", "Дробилка", "Дрон", "Ионизатор", "Испаритель",
	"Кабель", "Калькулятор", "Камера", "Катамаран", "Квадрокоптер", "Квадроцикл", "Кипятильник", "Клавиатура",
	"Колонка", "Коллайдер", "Комбайн", "Компрессор", "Компьютер", "Конвектор", "Кондиционер", "Корабль",
	"Кран", "Культиватор", "Лазер", "Ледокол", "Лимузин",
	"Локомотив", "Магнитофон", "Марсоход", "Микроскоп", "Микрофон", "Миксер", "Монитор",
	"Моноблок", "Моноколесо", "Мопед", "Мотоблок", "Мотоцикл", "Мультиварка", "Мультиметр", "Мясорубка",
	"Навигатор", "Наушники", "Ноутбук", "Обогреватель", "Объектив", "Осциллограф", "Паровоз", "Парогенератор",
	"Пароход", "Перфоратор", "Планшет", "Плеер", "Пневмопочта", "Поезд", "Прицеп",
	"Посудомойка", "Принтер", "Приставка", "Проигрыватель", "Проектор", "Процессор",
	"Пылесос", "Радар", "Радиатор", "Радиоприемник", "Рация", "Реактор", "Ресивер", "Рефрижератор",
	"Робот", "Роутер", "Самокат", "Самолет", "Самосвал", "Светофор", "Сервер",
	"Сигнализация", "Смартфон", "Снегоход", "Соковыжималка", "Спектрометр", "Спутник", "Стабилизатор", "Станок",
	"Сушилка", "Телевизор", "Телеграф", "Телескоп", "Телефон", "Тепловизор",
	"Тепловоз", "Теплоход", "Тостер", "Трактор", "Трамвай", "Трансформатор", "Трейлер",
	"Троллейбус", "Турбина", "Увлажнитель", "Утюг", "Факс", "Фотоаппарат", "Фрезер", "Холодильник",
	"Хлебопечка", "Хронометр", "Центрифуга", "Шокер", "Шуруповерт", "Эвакуатор",
	"Экскаватор", "Эпилятор", "Эхолот", "Якорь", "Яхта"
];

$wordsLimit = 128;

$topics = [ $food, $animals, $professions, $tech ];
$maxLength = 0;

echo '<pre>';
foreach ($topics as $t => $topic)
{
	echo "else if (topic == $t)\n";
	echo "{\n";

	//usort($topic, static fn($a, $b) => mb_strlen($a) <=> mb_strlen($b));
	$topic = array_filter($topic, static fn($item) => mb_strlen($item) <= 11);
	$topic = array_slice($topic, 0, $wordsLimit);
	shuffle($topic);

//	echo count($topic);
//	echo PHP_EOL;

	foreach ($topic as $key => $word)
	{
		$tabs = '   ';
		if ($key > 99)
		{
			$tabs = ' ';
		}
		else if ($key > 9)
		{
			$tabs = '  ';
		}

		$word = mb_strtolower(str_replace('ё', 'е', $word));

		printf("    if (key == %s)%sword = '%s';\n", $key, $tabs, $word);

		if (mb_strlen($word) > $maxLength)
		{
			$maxLength = mb_strlen($word);
		}
	}

	echo "}\n";
}
echo $maxLength;
echo '</pre>';